heatExchanger/all_auto/case_0_10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//maxCo           1.0;

//maxDi           10.0;

//adjustTimeStep  yes;

functions
{

    #includeFunc cellMaxHeaterT
    #includeFunc cellMaxFinT
    #includeFunc volAvgFinTemperature
    #includeFunc volAvgHeaterTemperature
    #includeFunc averageTempHeaterFinInterface
}

// ************************************************************************* //
