heatExchanger/all_auto/case_0_10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_fluid
    {
        type            patch;
        nFaces          35;
        startFace       25689;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          26;
        startFace       25724;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1366;
        startFace       25750;
    }
    walls_heater
    {
        type            patch;
        nFaces          208;
        startFace       27116;
    }
    base_fins
    {
        type            patch;
        nFaces          451;
        startFace       27324;
    }
)

// ************************************************************************* //
